Revit 2017 API
LoadCase.NatureCategory Property
 The nature category of the load case.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2017. Use CategoryId instead.")]
public LoadNatureCategory NatureCategory { get; set; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2017. Use CategoryId instead.")> _
Public Property NatureCategory As LoadNatureCategory
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2017. Use CategoryId instead.")]
public:
property LoadNatureCategory NatureCategory {
	LoadNatureCategory get ();
	void set (LoadNatureCategory value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace